Wi6labs/lorafabian/cpu/arm/stm32f103/usb-arch.c
#include <usb-arch.h>
#include <gpio.h>
//#include <nvic.h>
#include <stm32f10x_nvic.h>
#include <core_cm3.h>
#include <stdio.h>
#include <debug-uart.h>
#include <usb-stm32f103.h>
#include "stm32f10x_gpio.h"

//#define DEBUG
#ifdef DEBUG
#define PRINTFD(...) //printf(__VA_ARGS__)
#else
#define PRINTFD(...)
#endif

static unsigned int sleep_cmp;


typedef struct
{
  vu32 EPR[8];
  u32  RESERVED[8];
  vu32 CNTR;
  vu32 ISTR;
  vu32 FNR;
  vu32 DADDR;
  vu32 BTABLE;
} USB_TypeDef;

#define USB_BASE             (APB1PERIPH_BASE + 0x5c00)
#define USB_MEM_BASE	     (APB1PERIPH_BASE + 0x6000)
#define USB_MEM_SIZE	     (512)
#define USB ((volatile USB_TypeDef *) USB_BASE)

typedef struct {
  vu32 ADDR_TX;
  vu32 COUNT_TX;
  vu32 ADDR_RX;
  vu32 COUNT_RX;
} USB_HW_Buffer;

#define USB_EP0_BUF_SIZE (2*CTRL_EP_SIZE)

#define USB_EP1_BUF_SIZE (2*USB_EP1_SIZE)

#define USB_EP2_BUF_SIZE (2*USB_EP2_SIZE)

#define USB_EP3_BUF_SIZE (2*USB_EP3_SIZE)

#define USB_EP4_BUF_SIZE (2*USB_EP4_SIZE)

#define USB_EP5_BUF_SIZE (2*USB_EP5_SIZE)

#define USB_EP6_BUF_SIZE (2*USB_EP6_SIZE)

#define USB_EP7_BUF_SIZE (2*USB_EP7_SIZE)



#ifndef MAX_CTRL_DATA
#define MAX_CTRL_DATA 128
#endif
/* Double buffered IN endpoint */
#define ADDR_TX_0 ADDR_TX
#define ADDR_TX_1 ADDR_RX
#define COUNT_TX_0 COUNT_TX
#define COUNT_TX_1 COUNT_RX

/* Double buffered OUT endpoint */
#define ADDR_RX_0 ADDR_TX
#define ADDR_RX_1 ADDR_RX
#define COUNT_RX_0 COUNT_TX
#define COUNT_RX_1 COUNT_RX

#define USB_EPxR_EP_TYPE_BULK 0
#define USB_EPxR_EP_TYPE_CONTROL USB_EP0R_EP_TYPE_0
#define USB_EPxR_EP_TYPE_ISO USB_EP0R_EP_TYPE_1
#define USB_EPxR_EP_TYPE_INTERRUPT (USB_EP0R_EP_TYPE_1|USB_EP0R_EP_TYPE_0)

#define USB_EPxR_EP_DBL_BUF USB_EP0R_EP_KIND
#define USB_EPxR_EP_STATUS_OUT USB_EP0R_EP_KIND

#define USB_EPxR_STAT_RX_DISABLED 0
#define USB_EPxR_STAT_RX_STALL USB_EP0R_STAT_RX_0
#define USB_EPxR_STAT_RX_NAK USB_EP0R_STAT_RX_1
#define USB_EPxR_STAT_RX_VALID (USB_EP0R_STAT_RX_1|USB_EP0R_STAT_RX_0)

#define USB_EPxR_STAT_TX_DISABLED 0
#define USB_EPxR_STAT_TX_STALL USB_EP0R_STAT_TX_0
#define USB_EPxR_STAT_TX_NAK USB_EP0R_STAT_TX_1
#define USB_EPxR_STAT_TX_VALID (USB_EP0R_STAT_TX_1|USB_EP0R_STAT_TX_0)

#define USB_EPxR_SW_BUF_TX USB_EP0R_DTOG_RX
#define USB_EPxR_SW_BUF_RX USB_EP0R_DTOG_TX

static const uint16_t ep_buffer_size[8] =
  {
    USB_EP0_BUF_SIZE,
    USB_EP1_BUF_SIZE,
    USB_EP2_BUF_SIZE,
    USB_EP3_BUF_SIZE,
    USB_EP4_BUF_SIZE,
    USB_EP5_BUF_SIZE,
    USB_EP6_BUF_SIZE,
    USB_EP7_BUF_SIZE
  };

#define USB_EP_BUF_SIZE(ep) ep_buffer_size[ep]
#define USB_EP_BUF_OFFSET(ep) ep_buffer_offset[ep]
#define USB_EP_BUF_ADDR(ep) (u32*)(USB_MEM_BASE + ep_buffer_offset[ep]*2);
#define USB_EP_BUF_DESC(ep) ((USB_HW_Buffer*)(USB_MEM_BASE + 16 * (ep)))

#define USB_EP0_OFFSET (8*USB_MAX_ENDPOINTS)
#define USB_EP1_OFFSET (USB_EP0_OFFSET + USB_EP0_BUF_SIZE)
#define USB_EP2_OFFSET (USB_EP1_OFFSET + USB_EP1_BUF_SIZE)
#define USB_EP3_OFFSET (USB_EP2_OFFSET + USB_EP2_BUF_SIZE)
#define USB_EP4_OFFSET (USB_EP3_OFFSET + USB_EP3_BUF_SIZE)
#define USB_EP5_OFFSET (USB_EP4_OFFSET + USB_EP4_BUF_SIZE)
#define USB_EP6_OFFSET (USB_EP5_OFFSET + USB_EP5_BUF_SIZE)
#define USB_EP7_OFFSET (USB_EP6_OFFSET + USB_EP6_BUF_SIZE)

#if (USB_EP7_OFFSET+USB_EP7_BUF_SIZE) > USB_MEM_SIZE
#error USB endpoints buffers does not fit in USB memory
#endif
static const uint16_t ep_buffer_offset[8] =
  {
    USB_EP0_OFFSET,
    USB_EP1_OFFSET,
    USB_EP2_OFFSET,
    USB_EP3_OFFSET,
    USB_EP4_OFFSET,
    USB_EP5_OFFSET,
    USB_EP6_OFFSET,
    USB_EP7_OFFSET
  };

#define USB_EP_BUF_CAPACITY(s) ((((s) <64)?((s)/2):(0x20 | ((s)/64)))<<10)

typedef struct _USBEndpoint USBEndpoint;
struct _USBEndpoint
{
  uint16_t status;
  uint8_t addr;
  uint8_t flags;
  USBBuffer *buffer;	/* NULL if no current buffer */
  struct process *event_process;
  uint16_t events;
  uint16_t xfer_size;
};

#define USB_EP_FLAGS_TYPE_MASK 0x03
#define USB_EP_FLAGS_TYPE_BULK 0x00
#define USB_EP_FLAGS_TYPE_CONTROL 0x01
#define USB_EP_FLAGS_TYPE_ISO 0x02
#define USB_EP_FLAGS_TYPE_INTERRUPT 0x03

#define IS_EP_TYPE(ep, type) (((ep)->flags & USB_EP_FLAGS_TYPE_MASK) == (type))
#define IS_CONTROL_EP(ep) IS_EP_TYPE(ep, USB_EP_FLAGS_TYPE_CONTROL)
#define IS_BULK_EP(ep) IS_EP_TYPE(ep, USB_EP_FLAGS_TYPE_BULK)
#define IS_INTERRUPT_EP(ep) IS_EP_TYPE(ep, USB_EP_FLAGS_TYPE_INTERRUPT)

#define USB_EP_FLAGS_ENABLED 0x04

/* A packet has been received but the data is still in hardware buffer */
#define USB_EP_FLAGS_RECV_PENDING 0x08
/* The pending packet is a SETUP packet */
#define USB_EP_FLAGS_SETUP_PENDING 0x10

/* The data in the hardware buffer is being transmitted */
#define USB_EP_FLAGS_TRANSMITTING 0x20

/* The  receiver is waiting for a packet */
#define USB_EP_FLAGS_RECEIVING 0x40

/* For bulk endpoints. Both buffers are busy are in use, either by
   hardware or software. */
#define USB_EP_FLAGS_DOUBLE 0x80

/* States for double buffered reception:

Packets being received	0	1	2	1	0	0
Packets pending		0	0	0	1	2	1

RECVING			0	1	1	1	0	0
RECV_PENDING		0	0	0	1	1	1
DOUBLE			0	0	1	0	1	0
*/

/* States for double buffered transmission:
   
Packets being transmitted	0	1	2

TRANSMITTING			0	1	1
DOUBLE				0	0	1
*/

/* Index in endpoint array */
#define EP_INDEX(addr) ((addr) & 0x7f)

/* Get address of endpoint struct */
#define EP_STRUCT(addr) (&usb_endpoints[EP_INDEX(addr)])

/* Number of hardware endpoint */
#define EP_HW_NUM(addr) ((addr) & 0x7f)

#define USB_DISABLE_INT \
  NVIC_DisableIRQ(USB_LP_CAN_RX0_IRQChannel);\
  NVIC_DisableIRQ(USB_HP_CAN_TX_IRQChannel)
/*  NVIC_DISABLE_INT(USB_LP_CAN_RX0_IRQChannel);\
  NVIC_DISABLE_INT(USB_HP_CAN_TX_IRQChannel)*/

#define USB_ENABLE_INT \
  NVIC_EnableIRQ(USB_LP_CAN_RX0_IRQChannel);\
  NVIC_EnableIRQ(USB_HP_CAN_TX_IRQChannel)
/*  NVIC_ENABLE_INT(USB_LP_CAN_RX0_IRQChannel);\
  NVIC_ENABLE_INT(USB_HP_CAN_TX_IRQChannel)*/

static inline uint32_t
usb_save_disable_int()
{
  uint32_t v = NVIC->ISER[0];
  NVIC->ICER[0] = (1<<USB_HP_CAN_TX_IRQChannel | 1<<USB_LP_CAN_RX0_IRQChannel);
  return v;
}

static inline void
usb_restore_int(uint32_t v)
{
  NVIC->ISER[0] =
    v & (1<<USB_HP_CAN_TX_IRQChannel | 1<<USB_LP_CAN_RX0_IRQChannel);
}

static USBEndpoint usb_endpoints[USB_MAX_ENDPOINTS];
struct process *event_process = 0;
volatile unsigned int events = 0;

static void
notify_process(unsigned int e)
{
  events |= e;
  if (event_process) {
    process_poll(event_process);
  }
}

static void
notify_ep_process(USBEndpoint *ep, unsigned int e)
{
  ep->events |= e;
  if (ep->event_process) {
    process_poll(ep->event_process);
  }
}

