Wi6labs/lorafabian/cpu/arm/stm32f103/usb-arch.c
/*
 *  USB Device Suspend Function
 *   Called automatically on USB Device Suspend
 *    Return Value:    None
 */
void usb_arch_suspend(void) {
  USB->CNTR |= USB_CNTR_FSUSP;                   /* Force Suspend                      */
  USB->CNTR |= USB_CNTR_LP_MODE;                  /* Low Power Mode                     */
}

/*
 *  USB Device Remote Wakeup Function
 *   Called automatically on USB Device Remote Wakeup
 *    Return Value:    None
 */

void usb_arch_WakeUp (void) {
  USB->CNTR &= ~USB_CNTR_FSUSP;     /* Clear Suspend */
  USB->CNTR |= USB_CNTR_RESUME;
}




static void
usb_arch_reset(void)
{
  unsigned int e;
  for (e = 0; e < USB_MAX_ENDPOINTS; e++) {
    if (usb_endpoints[e].flags &USB_EP_FLAGS_ENABLED) {
      USBBuffer *buffer = usb_endpoints[e].buffer;
      usb_endpoints[e].flags = 0;
      while(buffer) {
	      buffer->flags &= ~USB_BUFFER_SUBMITTED;
	      buffer = buffer->next;
      }
    }
  }
  usb_arch_setup_control_endpoint(0);  
  USB->DADDR = 0x80;
}

void
usb_arch_setup(void)
{
  unsigned int i;
  RCC->APB1RSTR |= RCC_APB1RSTR_USBRST;
  //RCC->APB2ENR |=  (RCC_APB2ENR_AFIOEN | RCC_APB2ENR_IOPAEN | RCC_APB2ENR_IOPCEN);//???
  RCC->APB2ENR |=  (RCC_APB2ENR_IOPAEN | RCC_APB2ENR_IOPCEN);
  RCC->APB1ENR |= (RCC_APB1ENR_USBEN);
  RCC->APB1RSTR &= ~RCC_APB1RSTR_USBRST;

  //GPIO_CONF_OUTPUT_PORT(A,11,ALT_PUSH_PULL,50);
  //GPIO_CONF_OUTPUT_PORT(A,12,ALT_PUSH_PULL,50);

  GPIO_CONF_OUTPUT_PORT(C,12, OPEN_DRAIN, 10);

  //GPIOC->BSRR = GPIO_BSRR_BS12;

  GPIO_CONF_INPUT_PORT(C,11, FLOATING);//PUSH_PULL);

  /*reset*/
  USB->CNTR |= USB_CNTR_FRES;

  /* Turn on analog part */
  USB->CNTR &= ~USB_CNTR_PDWN;
  for (i = 0; i < 100; i++) asm("nop"::); /* Wait at least 1us */

  /* Release reset */
  USB->CNTR &= ~USB_CNTR_FRES;

  /* Clear any interrupts */
  USB->ISTR = ~(USB_ISTR_PMAOVR |USB_ISTR_ERR | USB_ISTR_WKUP | USB_ISTR_SUSP
		| USB_ISTR_RESET);

  for(i = 0; i < USB_MAX_ENDPOINTS; i++) {
    usb_endpoints[i].flags = 0;
    usb_endpoints[i].event_process = 0;
  }
  /* Put buffer table at beginning of buffer memory */
  USB->BTABLE = 0;
  usb_arch_reset();

  //GPIOC->BSRR = GPIO_BSRR_BS12;

  USB->CNTR |= (USB_CNTR_CTRM | USB_CNTR_PMAOVRM | USB_CNTR_ERRM
		| USB_CNTR_WKUPM| USB_CNTR_SUSPM | USB_CNTR_RESETM);

  NVIC_SetPriority(USB_LP_CAN_RX0_IRQChannel, 4);
  
  NVIC_EnableIRQ(USB_LP_CAN_RX0_IRQChannel);
  //NVIC_ENABLE_INT(USB_LP_CAN_RX0_IRQChannel);

  /*present to host*/
  GPIOC->BSRR = GPIO_BSRR_BR12;
  GPIO_WriteBit(GPIOC, 12, 1);
}

#define EPR_RW (USB_EP0R_EP_TYPE|USB_EP0R_EP_KIND|USB_EP0R_EA)
#define EPR_W0 (USB_EP0R_CTR_RX|USB_EP0R_CTR_TX)
#define EPR_TOGGLE (USB_EP0R_DTOG_RX | USB_EP0R_STAT_RX \
		    | USB_EP0R_DTOG_TX | USB_EP0R_STAT_TX)

#define EPR_INVARIANT(epr) ((epr & (EPR_RW)) | EPR_W0)

#define EPR_TOGGLE_SET(epr, mask, set) \
((((epr) & (EPR_RW | (mask))) | EPR_W0) ^ (set))

static void
usb_arch_setup_endpoint(unsigned char addr)
{
  USBEndpoint *ep = EP_STRUCT(addr);
  ep->status = 0;
  ep->flags = USB_EP_FLAGS_ENABLED;
  ep->buffer = 0;
  ep->addr = addr;
  ep->events = 0;
  ep->xfer_size = 0;
};

void
usb_arch_setup_control_endpoint(unsigned char addr)
{
  USB_HW_Buffer *buf_desc;
  unsigned int ei = EP_HW_NUM(addr);
  unsigned int epr;
  USBEndpoint *ep = EP_STRUCT(addr);
  usb_arch_setup_endpoint(addr);
  ep->flags |= USB_EP_FLAGS_TYPE_CONTROL;

  buf_desc = USB_EP_BUF_DESC(ei);
  buf_desc->ADDR_TX = USB_EP_BUF_OFFSET(ei);
  buf_desc->COUNT_TX = USB_EP_BUF_SIZE(ei)/2;
  buf_desc->ADDR_RX = USB_EP_BUF_OFFSET(ei) + USB_EP_BUF_SIZE(ei)/2;
  buf_desc->COUNT_RX = USB_EP_BUF_CAPACITY(USB_EP_BUF_SIZE(ei)/2);
  ep->xfer_size = USB_EP_BUF_SIZE(ei)/2;
  epr = USB->EPR[EP_HW_NUM(addr)];
  /* Clear interrupt flags */
  epr &= ~(USB_EP0R_CTR_RX | USB_EP0R_CTR_TX);
  /* NACK both directions */
  epr ^= USB_EPxR_STAT_RX_NAK | USB_EPxR_STAT_TX_NAK;
  /* Set control type */
  epr = ((epr & ~(USB_EP0R_EP_TYPE | USB_EP0R_EP_KIND))
	 | USB_EPxR_EP_TYPE_CONTROL);
  /* Set address */
  epr = ((epr & ~USB_EP0R_EA) | addr);
  USB->EPR[EP_HW_NUM(addr)] = epr; 
}

void
usb_arch_setup_bulk_endpoint(unsigned char addr)
{
  USB_HW_Buffer *buf_desc;
  unsigned int ei = EP_HW_NUM(addr);
  unsigned int epr;
  USBEndpoint *ep = EP_STRUCT(addr);
  usb_arch_setup_endpoint(addr);
  ep->flags |= USB_EP_FLAGS_TYPE_BULK;

  buf_desc = USB_EP_BUF_DESC(ei);
  buf_desc->ADDR_TX = USB_EP_BUF_OFFSET(ei);
  buf_desc->ADDR_RX = USB_EP_BUF_OFFSET(ei) + USB_EP_BUF_SIZE(ei)/2;
  epr = USB->EPR[ei];
  if (addr & 0x80) {
    /* IN */
    buf_desc->COUNT_TX_0 = 0;
    buf_desc->COUNT_TX_1 = 0;
    /* VALID transmission */
    epr ^= USB_EPxR_STAT_TX_VALID;
  } else {
    /* OUT */
    buf_desc->COUNT_RX_0 = USB_EP_BUF_CAPACITY(USB_EP_BUF_SIZE(ei)/2);
    buf_desc->COUNT_RX_1 = USB_EP_BUF_CAPACITY(USB_EP_BUF_SIZE(ei)/2);
    
    /* VALID reception  */
    epr ^= USB_EPxR_STAT_RX_VALID;
   }
  ep->xfer_size = USB_EP_BUF_SIZE(ei)/2;
  /* Clear interrupt flags */
  epr &= ~(USB_EP0R_CTR_RX | USB_EP0R_CTR_TX);
  /* Set bulk type */
  epr = ((epr & ~(USB_EP0R_EP_TYPE | USB_EP0R_EP_KIND))
	 | USB_EPxR_EP_TYPE_BULK | USB_EPxR_EP_DBL_BUF);
  /* Set address */
  epr = ((epr & ~USB_EP0R_EA) | addr);
  USB->EPR[ei] = epr;

}

void
usb_arch_setup_interrupt_endpoint(unsigned char addr)
{
  USB_HW_Buffer *buf_desc;
  unsigned int ei = EP_HW_NUM(addr);
  unsigned int epr;
  USBEndpoint *ep = EP_STRUCT(addr);
  usb_arch_setup_endpoint(addr);
  ep->flags |= USB_EP_FLAGS_TYPE_INTERRUPT;
  
  epr = USB->EPR[EP_HW_NUM(addr)];

  buf_desc = USB_EP_BUF_DESC(ei);
  if (addr & 0x80) {
    /* IN */
    buf_desc->ADDR_TX = USB_EP_BUF_OFFSET(ei);
    buf_desc->COUNT_TX = USB_EP_BUF_SIZE(ei);
    epr ^= USB_EPxR_STAT_TX_NAK;
  } else {
    /* OUT */
    buf_desc->ADDR_RX = USB_EP_BUF_OFFSET(ei);
    buf_desc->COUNT_RX = USB_EP_BUF_CAPACITY(USB_EP_BUF_SIZE(ei));
    epr ^= USB_EPxR_STAT_RX_NAK;
  }
  ep->xfer_size = USB_EP_BUF_SIZE(ei);
  /* Clear interrupt flags */
  epr &= ~(USB_EP0R_CTR_RX | USB_EP0R_CTR_TX);
  /* Set control type */
  epr = ((epr & ~(USB_EP0R_EP_TYPE | USB_EP0R_EP_KIND))
	 | USB_EPxR_EP_TYPE_INTERRUPT);
  /* Set address */
  epr = ((epr & ~USB_EP0R_EA) | addr);
  USB->EPR[EP_HW_NUM(addr)] = epr; 
}

void
usb_arch_disable_endpoint(uint8_t addr)
{
  unsigned int epr;
  USBEndpoint *ep = EP_STRUCT(addr);
  ep->flags &= ~USB_EP_FLAGS_ENABLED;
  
  epr = USB->EPR[EP_HW_NUM(addr)];

  epr ^= USB_EPxR_STAT_TX_DISABLED | USB_EPxR_STAT_RX_DISABLED;
  /* Clear interrupt flags */
  epr &= ~(USB_EP0R_CTR_RX | USB_EP0R_CTR_TX);
  USB->EPR[EP_HW_NUM(addr)] = epr; 
}

inline void
stall_bulk_in(unsigned int hw_ep)
{
  volatile uint32_t *eprp = &USB->EPR[hw_ep];
  *eprp = (*eprp & (EPR_RW | USB_EP0R_STAT_TX_1)) | EPR_W0;
  PRINTFD("HALT IN\n");
}

inline void
stall_bulk_out(unsigned int hw_ep)
{
  volatile uint32_t *eprp = &USB->EPR[hw_ep];
  *eprp = (*eprp & ((EPR_RW | USB_EP0R_STAT_RX_1) & ~USB_EP0R_CTR_RX)) |EPR_W0;
  PRINTFD("HALT OUT\n");
}


#define USB_READ_BLOCK 0x01	/* The currently submitted buffers
				   can't hold the received data, wait
				   for more buffers. No data was read
				   from the hardware buffer */
#define USB_READ_NOTIFY 0x02	/* Some buffers that had the
				   USB_BUFFER_NOTIFY flags set were
				   released */
#define USB_READ_FAIL 0x04	/* The received data doesn't match the
				   submitted buffers. The hardware
				   buffer is discarded. */

inline unsigned int
ep_capacity(unsigned int count)
{
  return (((count & USB_COUNT0_RX_NUM_BLOCK)>>10)
	  * ((count & USB_COUNT0_RX_BLSIZE) ? 32 : 2));
}

