Wi6labs/lorafabian/cpu/arm/stm32f103/usb-arch.c
/* Skip buffers until mask and flags matches*/
static USBBuffer *
skip_buffers_until(USBBuffer *buffer, unsigned int mask, unsigned int flags,
		   unsigned int *resp)
{
  while(buffer && !((buffer->flags & mask) == flags)) {
    USBBuffer *next = buffer->next;
    buffer->flags &= ~USB_BUFFER_SUBMITTED ;
    buffer->flags |= USB_BUFFER_FAILED;
    if (buffer->flags & USB_BUFFER_NOTIFY) *resp |= USB_READ_NOTIFY;
    buffer = next;
  }
  return buffer;
}

static void
read_hw_buffer(USBBuffer *buffer, unsigned int offset, unsigned int len)
{
#ifdef USB_STM32F103_ENABLE_ALT_COPY
  if (buffer->flags & USB_BUFFER_ARCH_ALT_COPY) {
    copy_from_hw_buffer(buffer, offset, len);
  } else
#endif
    {
      uint8_t *data = buffer->data;
      const uint32_t *hw_data = ((u32*)USB_MEM_BASE) + offset/2;
      buffer->data += len;
      if (offset & 1) {
	*data++ = *hw_data++ >> 8;
	len--;
      }
      while(len >= 2) {
	*((uint16_t*)data) = *hw_data++;
	data += 2;
	len -= 2;
      }
      if (len == 1) {
	*data++ = *hw_data;
      }
    }
}


#define USB_WRITE_BLOCK 0x01
#define USB_WRITE_NOTIFY 0x02

void
write_hw_buffer(USBBuffer *buffer,unsigned int offset, unsigned int len)
{
#ifdef USB_STM32F103_ENABLE_ALT_COPY
  if (buffer->flags & USB_BUFFER_ARCH_ALT_COPY) {
    copy_to_hw_buffer(buffer, offset, len);
  } else
#endif    
    {
      const uint8_t *data;
      uint32_t *hw_data;
      if (len == 0) return;
      data = buffer->data;
      hw_data = ((u32*)USB_MEM_BASE) + offset/2;
      buffer->data += len;
      if (offset & 1) {
	*hw_data = (*hw_data & 0xff) | (*data++ << 8);
	hw_data++;
	len--;
      }
      while(len >= 2) {
	*hw_data++ = *((uint16_t*)data) ;
	data += 2;
	len -= 2;
      }
      if (len == 1) {
	*hw_data = *data++;
      }
    }
}

static unsigned int
get_receive_capacity(USBBuffer *buffer)
{
  unsigned int capacity = 0;
  while(buffer && !(buffer->flags & (USB_BUFFER_IN| USB_BUFFER_SETUP|USB_BUFFER_HALT))) {
    capacity += buffer->left;
    buffer = buffer->next;
  }
  return capacity;
}

static int
handle_pending_receive(USBEndpoint *ep)
{
  int short_packet;
  unsigned int len;
  unsigned int copy;
  unsigned int res = 0;
  unsigned int hw_offset;
  unsigned int hw_ep = EP_HW_NUM(ep->addr);
  USBBuffer *buffer = ep->buffer;
  unsigned int flags = ep->flags;
  USB_HW_Buffer *buf_desc = USB_EP_BUF_DESC(hw_ep);
  PRINTFD("handle_pending_receive:\n"); 
  if (!(flags & USB_EP_FLAGS_ENABLED) || !buffer) return USB_READ_BLOCK;
  switch(flags & USB_EP_FLAGS_TYPE_MASK) {
  case USB_EP_FLAGS_TYPE_CONTROL:
    len = buf_desc->COUNT_RX & USB_COUNT0_RX_COUNT0_RX;
    if (flags & USB_EP_FLAGS_SETUP_PENDING) {
      /* Discard buffers until we find a SETUP buffer */
      buffer =
	skip_buffers_until(buffer, USB_BUFFER_SETUP, USB_BUFFER_SETUP, &res);
      ep->buffer = buffer;
      if (!buffer || buffer->left < len) {
	res |= USB_READ_BLOCK;
	return res;
      }
      /* SETUP buffer must fit in a single buffer */
      if (buffer->left < len) {
	buffer->flags |= USB_BUFFER_FAILED;
	buffer->flags &= ~USB_BUFFER_SUBMITTED ;
	if (buffer->flags & USB_BUFFER_NOTIFY) res |= USB_READ_NOTIFY;
	ep->buffer = buffer->next;
	res |= USB_READ_FAIL;
	return res;
      }
    } else {
      if (buffer->flags & (USB_BUFFER_SETUP|USB_BUFFER_IN)) {
	buffer->flags |= USB_BUFFER_FAILED;
	
	buffer->flags &= ~USB_BUFFER_SUBMITTED ;
	if (buffer->flags & USB_BUFFER_NOTIFY) res |= USB_READ_NOTIFY;
	ep->buffer = buffer->next;
	res |= USB_READ_FAIL;
	return res;
      }

      if (len == 0) {
	/* Status OUT */
	if (buffer->left > 0) {
	  buffer->flags |= USB_BUFFER_FAILED;
	  res |= USB_READ_FAIL;
	}
	buffer->flags &= ~USB_BUFFER_SUBMITTED ;
	if (buffer->flags & USB_BUFFER_NOTIFY) res |= USB_READ_NOTIFY;
	ep->buffer = buffer->next;
	return res;
      }
      if (get_receive_capacity(buffer) <  len) return USB_READ_BLOCK;
    }
    hw_offset =  buf_desc->ADDR_RX;
    break;
  case USB_EP_FLAGS_TYPE_INTERRUPT:
    len = buf_desc->COUNT_RX & USB_COUNT0_RX_COUNT0_RX;
    if (get_receive_capacity(buffer) <  len) return USB_READ_BLOCK;
    hw_offset =  buf_desc->ADDR_RX;
    break;
  case USB_EP_FLAGS_TYPE_BULK:
     if (USB->EPR[hw_ep] & USB_EPxR_SW_BUF_RX) {
      len = buf_desc->COUNT_RX_1 & USB_COUNT0_RX_COUNT0_RX;
      hw_offset =  buf_desc->ADDR_RX_1;
    } else {
      len = buf_desc->COUNT_RX_0 & USB_COUNT0_RX_COUNT0_RX;
      hw_offset =  buf_desc->ADDR_RX_0;
    }
    if (get_receive_capacity(buffer) <  len) return USB_READ_BLOCK;
    break;
  case USB_EP_FLAGS_TYPE_ISO:
    len = buf_desc->COUNT_RX & USB_COUNT0_RX_COUNT0_RX;
    if (get_receive_capacity(buffer) <  len) return USB_READ_BLOCK;
    hw_offset =  buf_desc->ADDR_RX;
  }
  /* printf("handle_pending_receive: %d %04x\n", len, ep->flags);   */
  short_packet = len < ep->xfer_size;

  do {
    if (buffer->left < len) {
      copy = buffer->left;
    } else {
      copy = len;
    }
    len -= copy;
    buffer->left -= copy;
    read_hw_buffer(buffer, hw_offset, copy);
    hw_offset += copy;

    if (len == 0) break;

    /* Release buffer */
    buffer->flags &= ~(USB_BUFFER_SUBMITTED | USB_BUFFER_SHORT_PACKET);
    if (buffer->flags & USB_BUFFER_NOTIFY) res |= USB_READ_NOTIFY;
    /* Use next buffer. */
    buffer = buffer->next;
  } while(1);
  
  if (short_packet) {
    buffer->flags |= USB_BUFFER_SHORT_PACKET;
  }
  
  if ((buffer->left == 0)
      || (buffer->flags & USB_BUFFER_PACKET_END)
      || (short_packet && (buffer->flags & USB_BUFFER_SHORT_END))) {
    /* Release buffer */
    buffer->flags &= ~USB_BUFFER_SUBMITTED;
    if (buffer->flags & USB_BUFFER_NOTIFY) res |= USB_READ_NOTIFY;
    /* Use next buffer. */
    buffer = buffer->next;
  }
  
  ep->buffer = buffer;
  if (IS_BULK_EP(ep)) {
    USB->EPR[hw_ep] = EPR_INVARIANT(USB->EPR[hw_ep]) | USB_EPxR_SW_BUF_RX;
  }

  /* PRINTF("read_endpoint %d %d\n", (int)hw_offset-buf_desc->ADDR_RX, (int)buf_desc->ADDR_RX); */
  return res;
}


static void
start_receive(USBEndpoint *ep)
{
  unsigned int hw_ep = EP_HW_NUM(ep->addr);
  uint32_t epr =  (USB->EPR[hw_ep] | EPR_W0);
  uint32_t epr_mask = EPR_RW | EPR_W0;
  switch(ep->flags & USB_EP_FLAGS_TYPE_MASK) {
  case USB_EP_FLAGS_TYPE_CONTROL:
  case USB_EP_FLAGS_TYPE_INTERRUPT:
    {
      unsigned int capacity = get_receive_capacity(ep->buffer);
      if (capacity <= ep->xfer_size) {
	/* This is the last OUT packet of the data stage */
	epr ^= USB_EPxR_STAT_TX_NAK;
      } else {
	epr ^= USB_EPxR_STAT_TX_STALL;
      }
      epr ^= USB_EPxR_STAT_RX_VALID;
      epr_mask |= USB_EP0R_STAT_TX | USB_EP0R_STAT_RX;
    }
    break;
  case USB_EP_FLAGS_TYPE_BULK:
  case USB_EP_FLAGS_TYPE_ISO: 
   break;
  }
  ep->flags |= USB_EP_FLAGS_RECEIVING;
  USB->EPR[hw_ep] = epr & epr_mask;
}

static unsigned int
get_transmit_length(USBBuffer *buffer)
{
  unsigned int length = 0;
  while(buffer && (buffer->flags & USB_BUFFER_IN)) {
    length += buffer->left;
    buffer = buffer->next;
  }
  return length;
}

static int
start_transmit(USBEndpoint *ep)
{
  unsigned int hw_start;
  unsigned int res = 0;
  USBBuffer *buffer = ep->buffer;
  unsigned int len;
  unsigned int hw_offset;
  volatile uint32_t *hw_countp;
  unsigned int hw_ep = EP_HW_NUM(ep->addr);
  uint32_t epr =  USB->EPR[hw_ep];
  unsigned int ep_flags = ep->flags;
  USB_HW_Buffer *buf_desc = USB_EP_BUF_DESC(hw_ep);
  len = ep->xfer_size;
  if (!(ep_flags & USB_EP_FLAGS_ENABLED) || !buffer) return USB_WRITE_BLOCK;
  /* PRINTF("start_transmit: %02x\n", ep->addr); */
  switch(ep_flags & USB_EP_FLAGS_TYPE_MASK) {
  case USB_EP_FLAGS_TYPE_CONTROL:
    
    if (get_transmit_length(ep->buffer) <= len) {
      /* This is the last IN packet of the data stage */
      USB->EPR[hw_ep] = USB_EPxR_EP_STATUS_OUT 
	| EPR_TOGGLE_SET(epr, USB_EP0R_STAT_RX, USB_EPxR_STAT_RX_NAK);
    } else {
      USB->EPR[hw_ep] = USB_EPxR_EP_STATUS_OUT
	| EPR_TOGGLE_SET(epr, USB_EP0R_STAT_RX, USB_EPxR_STAT_RX_STALL);
    }
    hw_offset =  buf_desc->ADDR_TX;
    hw_countp = &buf_desc->COUNT_TX;
    break;
  case USB_EP_FLAGS_TYPE_BULK:
    if (buffer->flags & USB_BUFFER_HALT) {
      if (ep->status & 0x01) return USB_WRITE_BLOCK;
      ep->status |= 0x01;
      stall_bulk_in(hw_ep);
      return USB_WRITE_BLOCK;
    }
    if (USB->EPR[hw_ep] & USB_EPxR_SW_BUF_TX) {
      hw_offset =  buf_desc->ADDR_TX_1;
      hw_countp = &buf_desc->COUNT_TX_1;
    } else {
      hw_offset =  buf_desc->ADDR_TX_0;
      hw_countp = &buf_desc->COUNT_TX_0;
    }
    break;
  }
  hw_start = hw_offset;
  while (buffer) {
    unsigned int copy;
    if (buffer->left < len) {
      copy = buffer->left;
    } else {
      copy = len;
    }
    len -= copy;
    buffer->left -= copy;
    write_hw_buffer(buffer, hw_offset, copy);
    hw_offset += copy;
    if (buffer->left == 0) {
      if (buffer->flags & USB_BUFFER_SHORT_END) {
	if (len == 0) {
	  /* Send zero length packet. */
	  break; /* Leave without moving to next buffer */
	} else {
	  len = 0;
	}
      }
      /* Release buffer */
      buffer->flags &= ~USB_BUFFER_SUBMITTED;
      if (buffer->flags & USB_BUFFER_NOTIFY) res = USB_WRITE_NOTIFY;
	   /* Use next buffer. */
      buffer = buffer->next;
    }
    if (len == 0) break;
  }
  ep->buffer = buffer;
  if (ep->flags & USB_EP_FLAGS_TRANSMITTING) {
    ep->flags |= USB_EP_FLAGS_DOUBLE;
  } else {
    ep->flags |= USB_EP_FLAGS_TRANSMITTING;
  }
  *hw_countp = hw_offset - hw_start;
  /* printf("start_transmit: %02x %d %04lx\n", ep->addr, hw_offset - hw_start, USB->EPR[hw_ep]); */
  switch(ep->flags & USB_EP_FLAGS_TYPE_MASK) {
  case USB_EP_FLAGS_TYPE_CONTROL:
  case USB_EP_FLAGS_TYPE_INTERRUPT:
    USB->EPR[hw_ep] =
      EPR_TOGGLE_SET(epr, USB_EP0R_STAT_TX, USB_EPxR_STAT_TX_VALID);
    break;
  case USB_EP_FLAGS_TYPE_BULK:
    USB->EPR[hw_ep] = EPR_INVARIANT(USB->EPR[hw_ep]) | USB_EPxR_SW_BUF_TX;
    break;
  case USB_EP_FLAGS_TYPE_ISO:
    break;
  }
/*   printf("start_transmit: %04x\n", USB->EPR[hw_ep]); */
  return res;
}

static void
start_transfer(USBEndpoint *ep)
{
  int res;
  while (1) {
    if (!(ep->addr & 0x80) && (IS_BULK_EP(ep) || IS_INTERRUPT_EP(ep))) {
      if (ep->buffer && (ep->buffer->flags & USB_BUFFER_HALT)) {
	if (ep->status & 0x01) return ;
	ep->status |= 0x01;
	stall_bulk_out(EP_HW_NUM(ep->addr));
	return;
      }
    }
    if (!(ep->flags & USB_EP_FLAGS_RECV_PENDING)) break;
    res = handle_pending_receive(ep);
    if (res & USB_READ_NOTIFY) {
      notify_ep_process(ep, USB_EP_EVENT_NOTIFICATION);
    }
    if (res & USB_READ_BLOCK) return;
    if (ep->flags & USB_EP_FLAGS_DOUBLE) {
      ep->flags &= ~USB_EP_FLAGS_DOUBLE;
    } else {
      ep->flags &= ~(USB_EP_FLAGS_RECV_PENDING|USB_EP_FLAGS_SETUP_PENDING);
    }
    if (res & USB_READ_FAIL) {
      /* Only fails for control endpoints */
      usb_arch_control_stall(ep->addr);
      return;
    }
  }
  if (ep->addr == 0x02) {
    /*PRINTF("start EPR: %04x ep->flags: %02x\n",
	   (unsigned int)USB->EPR[EP_HW_NUM(ep->addr)],
	   (unsigned int)ep->flags);*/
      }
  if (ep->flags & (USB_EP_FLAGS_TRANSMITTING | USB_EP_FLAGS_RECEIVING)) {
    if (!IS_BULK_EP(ep) || (ep->flags & USB_EP_FLAGS_DOUBLE)) {
      PRINTFD("Busy\n");
      return;
    }
  }
  if (ep->status & 0x01) return; /* Don't start transfer if halted */
  if (ep->buffer) {
    if (ep->buffer->flags & USB_BUFFER_IN) {
      res = start_transmit(ep);
      if (res & USB_READ_NOTIFY) {
	notify_ep_process(ep, USB_EP_EVENT_NOTIFICATION);
      }
    } else {
      start_receive(ep);
    }
  }
}


static void
transfer_complete(unsigned int hw_ep) {
  uint32_t epr =  USB->EPR[hw_ep];
  USBEndpoint *ep = &usb_endpoints[hw_ep];
  if (epr &USB_EP0R_CTR_RX) {
    PRINTFD("Received packet %lx %04x\n", USB_EP_BUF_DESC(hw_ep)->COUNT_RX, (int)USB->EPR[hw_ep]);
    if (epr & USB_EP0R_SETUP) {
      PRINTFD("SETUP\n"); 
      ep->flags |= USB_EP_FLAGS_SETUP_PENDING;
    }

    if (IS_BULK_EP(ep)) {
      if ((epr ^ (epr >> 8)) & USB_EP0R_DTOG_TX) {
	ep->flags &= ~USB_EP_FLAGS_DOUBLE;
      } else {
	ep->flags |= USB_EP_FLAGS_DOUBLE;
	ep->flags &= ~USB_EP_FLAGS_RECEIVING;
      }
    } else {
      ep->flags &= ~USB_EP_FLAGS_RECEIVING;
    }
    ep->flags |= USB_EP_FLAGS_RECV_PENDING;
    if (IS_CONTROL_EP(ep)) epr &= ~USB_EPxR_EP_STATUS_OUT;
    USB->EPR[hw_ep] = EPR_INVARIANT(epr) & ~USB_EP0R_CTR_RX;
#if 0
    if (ep->flags & USB_EP_FLAGS_DOUBLE) {
      printf("Double\n");
    }
#endif

